_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДопЗМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДопЗМТек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимВозвратМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимЗарплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимОснЗарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимПрямЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимСтоимМатер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимОборудЗаказчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекСтоимПоПрайсам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Смета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ПозицияЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРасценки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МебельИнвентарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_УровеньЗаданияИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_УровеньЗаданияИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_СпособыРасчетаИндексов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_СпособыРасчетаИндексов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПолнойСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЭлементамЗатрат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВариантыПересчетаЭММ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВариантыПересчетаЭММ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Одинаковые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазныеКРазности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ОбработкаПогрешностиОкругления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ОбработкаПогрешностиОкругления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазницуНаНаибольшую</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПЗЧерезСумму</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВидыРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВидыРесурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаРабочих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗатратыТрудаМашинистов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиныИМеханизмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перебазировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Транспортировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ТипыМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ТипыМатериалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчтенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МестныйМатериал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СМ_ВариантыРасчетаЗМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СМ_ВариантыРасчетаЗМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Усредненный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_СметаРасчетБазисноИндексныйСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет расчет текущей стоимости позиции и записывает результат в РС
// СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.
//
// Параметры:
//     Позиция 						- ДокументОбъект.СМ_ПозицияЛокальнойСметы - объект позиции.
//     СтруктураДанныхРасчета 		- Структура - содержит таблицы данных для расчета (см. менеджер СМ_ПозицияЛокальнойСметы).
//     ЛС 							- ДокументСсылка.СМ_ЛокальнаяСмета - ссылка на локальную смету.  
//     Акт 							- ДокументСсылка.СМ_АктыВыполненныхРабот - если задан акт, передается ссылка на него.
//     СтруктураПараметровОтбораРС 	- Структура - содержит поля для дополнительного отбора результирующего регистра сведений.
//     ИспользоватьРС 				- Булево - если Ложь, то все считается без чтения и записи из РС.
//
Процедура РасчитатьКоэфициенты(Позиция, СтруктураДанныхРасчета, ЛС, Акт, СтруктураПараметровОтбораРС = Неопределено, ИспользоватьРС = Истина) Экспорт
	
	Если СтруктураПараметровОтбораРС = Неопределено Тогда
		СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(Позиция, Акт, "СМ_ПозицияЛокальнойСметы");
	КонецЕсли;
	
	ПромОкр = Ложь;
	ОкрИтог = Ложь;
	ОбрабПогр = Неопределено;
	РасчетОтПрямыхЗатрат = Ложь;
	БезПримененияКоэффициентов = Ложь;
	Метод1984 = ПолучитьФункциональнуюОпцию("СМ_Методика84Года");
	Если Метод1984 Тогда
		РасчетОтПоямыхЗатрат  = СтруктураПараметровОтбораРС.СсылкаНаСмету.РасчетНРиСПотПЗ;	
		БезПримененияКоэффициентов = СтруктураПараметровОтбораРС.СсылкаНаСмету.БезПримененияКоэффициентов;
	КонецЕсли;	
	Если Акт = Неопределено Тогда
		ПромОкр = ЛС.ПромежуточноеОкругление;
		ОкрИтог = ЛС.ОкруглятьДоРублей;
		ОбрабПогр = ЛС.ОбрабатыватьПогрешность;
	Иначе
		ПромОкр = Акт.ПромежуточноеОкругление;
		ОкрИтог = Акт.ОкруглятьДоРублей;
		ОбрабПогр = Акт.ОбрабатыватьПогрешность;
	КонецЕсли;
	
	Если ИспользоватьРС Тогда
	
		НаборЗаписей = РегистрыСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		НаборЗаписей.Прочитать();
		
		СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета = НаборЗаписей.Выгрузить();
		
	Иначе
		
		СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета = СтруктураДанныхРасчета.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Скопировать();
	
	КонецЕсли;
	
	СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Колонки.Добавить("Итог");
	
	ТаблКоэф = Позиция.КоэффициентыПересчета.Выгрузить();
	
	Если Акт = Неопределено Тогда
		ТекущаяЦена = Позиция.ТекущаяЦена;
		ТекущаяЗарплатаМашинистов = Позиция.ТекущаяЗарплатаМашинистов
	Иначе
		ТаблКоэф.Очистить();
		СтрокаВАкте = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция);
		Если Не СтрокаВАкте = Неопределено Тогда
			НовыеКоэф = ТаблКоэф.Добавить();
			ЗаполнитьЗначенияСвойств(НовыеКоэф,СтрокаВАкте);
			ТекущаяЦена = СтрокаВАкте.ТекущаяЦена ;
			ТекущаяЗарплатаМашинистов = СтрокаВАкте.ТекущаяЗарплатаМашинистов
		КонецЕсли;
	КонецЕсли;
	
	Если РасчетОтПрямыхЗатрат  И БезПримененияКоэффициентов Тогда
		ТаблКоэф.Очистить();
	КонецЕсли;	
	 
	НеПрименятьИндексы = Позиция.НеПрименятьИндексы;
	ВР = Позиция.Определитель.ВидРасценки;
	Материал = Ложь ;
	Оборудование = Ложь ;
	Прочее = Ложь ;
	
	Если ВР = Перечисления.СМ_ВидыРасценки.Материал Тогда
		Материал = Истина
	ИначеЕсли ВР = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
		Оборудование = Истина
	Иначе
		Прочее = Истина;	
	КонецЕсли;
	
	Для Каждого СтрокаТаблСЧП Из СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета Цикл
		Для Каждого СтрокаТаблКоэф Из ТаблКоэф Цикл
			
			Если ЛС.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка Тогда

				Для Каждого Колонка Из ТаблКоэф.Колонки Цикл
					Если ТипЗнч(СтрокаТаблКоэф[Колонка.Имя]) = Тип("Число") И СтрокаТаблКоэф[Колонка.Имя] = 0 Тогда
						СтрокаТаблКоэф[Колонка.Имя] = 1;	
					КонецЕсли;
				КонецЦикла;
				Если НеПрименятьИндексы = Ложь Тогда 
					Если ЛС.СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат Тогда
						Если СтрокаТаблКоэф.КоэффПолнСтоимРабот <> 1 Тогда
							Если СтрокаТаблСЧП.СтоимЭксплМашин + СтрокаТаблСЧП.СтоимОснЗарплата + СтрокаТаблСЧП.СтоимСтоимМатер + СтрокаТаблСЧП.СтоимОборуд = 0 Тогда
								СтрокаТаблСЧП.СтоимПрямЗатраты = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимПрямЗатраты  * СтрокаТаблКоэф.КоэффПолнСтоимРабот,2),СтрокаТаблСЧП.СтоимПрямЗатраты  * СтрокаТаблКоэф.КоэффПолнСтоимРабот);	
							КОнецЕсли;	
						Иначе	
							
							НачДобавЗМ = СтрокаТаблСЧП.ДопЗМ;
							СтрокаТаблСЧП.СтоимЭксплМашин = СтрокаТаблСЧП.СтоимЭксплМашин - НачДобавЗМ;
							СтрокаТаблСЧП.СтоимЗарплМашин = СтрокаТаблСЧП.СтоимЗарплМашин;
							ИндексироватьДопЗМФот = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ИндексироватьДопЗМФот",Ложь);	
							КоэффЗМ = ?(ИндексироватьДопЗМФот, СтрокаТаблКоэф.КоэффОснЗарплаты, СтрокаТаблКоэф.КоэффСтоимЭксплМашин);					// к расценке применяются индексы
							Если ЛС.ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Одинаковые Тогда
								СтрокаТаблСЧП.СтоимЭксплМашин = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимЭксплМашин * СтрокаТаблКоэф.КоэффСтоимЭксплМашин,2),СтрокаТаблСЧП.СтоимЭксплМашин * СтрокаТаблКоэф.КоэффСтоимЭксплМашин);	
								СтрокаТаблСЧП.СтоимЗарплМашин = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффСтоимЭксплМашин,2),СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффСтоимЭксплМашин);
							ИначеЕсли ЛС.ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Разные Тогда
								СтрокаТаблСЧП.СтоимЭксплМашин = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимЭксплМашин * СтрокаТаблКоэф.КоэффСтоимЭксплМашин,2),СтрокаТаблСЧП.СтоимЭксплМашин * СтрокаТаблКоэф.КоэффСтоимЭксплМашин);	
								СтрокаТаблСЧП.СтоимЗарплМашин = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффСтоимЗарплатеМашин,2),СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффСтоимЗарплатеМашин);	  
							ИначеЕсли ЛС.ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.РазныеКРазности Тогда
								СтрокаТаблСЧП.СтоимЭксплМашин = ?(ПромОкр,Окр((СтрокаТаблСЧП.СтоимЭксплМашин-СтрокаТаблСЧП.СтоимЗарплМашин) * СтрокаТаблКоэф.КоэффСтоимЭксплМашин,2),(СтрокаТаблСЧП.СтоимЭксплМашин-СтрокаТаблСЧП.СтоимЗарплМашин) * СтрокаТаблКоэф.КоэффСтоимЭксплМашин);	
								СтрокаТаблСЧП.СтоимЗарплМашин =?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффСтоимЗарплатеМашин,2), СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффСтоимЗарплатеМашин);	
								СтрокаТаблСЧП.СтоимЭксплМашин = СтрокаТаблСЧП.СтоимЭксплМашин + СтрокаТаблСЧП.СтоимЗарплМашин;	
							КонецЕсли;
							УчитыватьДопЗМ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","УчитыватьДопЗМ",Ложь);	
							Если УчитыватьДопЗМ  Тогда
								СтрокаТаблСЧП.СтоимЭксплМашин = СтрокаТаблСЧП.СтоимЭксплМашин  +  ?(ПромОкр,Окр(НачДобавЗМ * КоэффЗМ,2), НачДобавЗМ * КоэффЗМ);
								СтрокаТаблСЧП.СтоимЗарплМашин = СтрокаТаблСЧП.СтоимЗарплМашин; 	
							КонецЕсли;
							СтрокаТаблСЧП.СтоимОснЗарплата = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимОснЗарплата * СтрокаТаблКоэф.КоэффОснЗарплаты,2),СтрокаТаблСЧП.СтоимОснЗарплата * СтрокаТаблКоэф.КоэффОснЗарплаты);
							СтрокаТаблСЧП.СтоимСтоимМатер 	= ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимСтоимМатер * СтрокаТаблКоэф.КоэффСтоимМатериалов,2),СтрокаТаблСЧП.СтоимСтоимМатер * СтрокаТаблКоэф.КоэффСтоимМатериалов);	
							СтрокаТаблСЧП.СтоимВозвратМатер = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимВозвратМатер * СтрокаТаблКоэф.КоэффСтоимМатериалов,2),СтрокаТаблСЧП.СтоимВозвратМатер * СтрокаТаблКоэф.КоэффСтоимМатериалов);	
							СтрокаТаблСЧП.СтоимОборуд 		= ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимОборуд * СтрокаТаблКоэф.КоэффОборуд,2),СтрокаТаблСЧП.СтоимОборуд * СтрокаТаблКоэф.КоэффОборуд);	
						КонецЕсли;	
					Иначе
						// Коэффициент к полной стоимости.   
						СтрокаТаблСЧП.СтоимЭксплМашин = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимЭксплМашин * СтрокаТаблКоэф.КоэффПолнСтоимРабот,2),СтрокаТаблСЧП.СтоимЭксплМашин * СтрокаТаблКоэф.КоэффПолнСтоимРабот);	
						СтрокаТаблСЧП.СтоимЗарплМашин = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффПолнСтоимРабот,2),СтрокаТаблСЧП.СтоимЗарплМашин * СтрокаТаблКоэф.КоэффПолнСтоимРабот);
						СтрокаТаблСЧП.СтоимОснЗарплата = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимОснЗарплата * СтрокаТаблКоэф.КоэффПолнСтоимРабот,2),СтрокаТаблСЧП.СтоимОснЗарплата * СтрокаТаблКоэф.КоэффПолнСтоимРабот);
						СтрокаТаблСЧП.СтоимСтоимМатер 	= ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимСтоимМатер * СтрокаТаблКоэф.КоэффПолнСтоимРабот,2),СтрокаТаблСЧП.СтоимСтоимМатер * СтрокаТаблКоэф.КоэффПолнСтоимРабот);	
						СтрокаТаблСЧП.СтоимВозвратМатер = ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимВозвратМатер * СтрокаТаблКоэф.КоэффПолнСтоимРабот,2),СтрокаТаблСЧП.СтоимВозвратМатер * СтрокаТаблКоэф.КоэффПолнСтоимРабот);	
						СтрокаТаблСЧП.СтоимОборуд 		= ?(ПромОкр,Окр(СтрокаТаблСЧП.СтоимОборуд * СтрокаТаблКоэф.КоэффПолнСтоимРабот,2),СтрокаТаблСЧП.СтоимОборуд * СтрокаТаблКоэф.КоэффПолнСтоимРабот);	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если ЛС.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка
			Или ЛС.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			
			Если НеПрименятьИндексы Тогда
				// Для оборудования и материалов берутся текущие цены.
				Если Материал Тогда
					СтрокаТаблСЧП.СтоимСтоимМатер 	= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимСтоимМатер,2),СтрокаТаблСЧП.ТекСтоимСтоимМатер);	
					СтрокаТаблСЧП.СтоимПрямЗатраты 	= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимСтоимМатер,2),СтрокаТаблСЧП.ТекСтоимСтоимМатер);	
				ИначеЕсли Оборудование Тогда	
					СтрокаТаблСЧП.СтоимОборуд 		= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимОборуд,2),СтрокаТаблСЧП.ТекСтоимОборуд);	
				Иначе
					Если (СтрокаТаблСЧП.СтоимСтоимМатер = СтрокаТаблСЧП.СтоимПрямЗатраты) Тогда
						СтрокаТаблСЧП.СтоимСтоимМатер 	= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимСтоимМатер,2),СтрокаТаблСЧП.ТекСтоимСтоимМатер);	
						СтрокаТаблСЧП.СтоимПрямЗатраты 	= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимСтоимМатер,2),СтрокаТаблСЧП.ТекСтоимСтоимМатер);	
					Иначе	
						СтрокаТаблСЧП.СтоимЭксплМашин 		= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимЭксплМашин,2),СтрокаТаблСЧП.ТекСтоимЭксплМашин);	
						СтрокаТаблСЧП.СтоимПрямЗатраты 		= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимЭксплМашин,2),СтрокаТаблСЧП.ТекСтоимЭксплМашин);	
						СтрокаТаблСЧП.СтоимЗарплМашин 		= ?(ПромОкр,Окр(СтрокаТаблСЧП.ТекСтоимЗарплМашин,2),СтрокаТаблСЧП.ТекСтоимЗарплМашин);	
					КонецЕсли;	
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
		Если  СтрокаТаблСЧП.СтоимОснЗарплата + СтрокаТаблСЧП.СтоимЭксплМашин + СтрокаТаблСЧП.СтоимСтоимМатер <> 0 Тогда
			СтрокаТаблСЧП.СтоимПрямЗатраты = СтрокаТаблСЧП.СтоимОснЗарплата + СтрокаТаблСЧП.СтоимЭксплМашин + СтрокаТаблСЧП.СтоимСтоимМатер;	
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗаполнитьЗначения(СтруктураПараметровОтбораРС.СсылкаНаРаздел,"Раздел");
	Отбор = Новый Структура("Позиция, Смета",СтруктураПараметровОтбораРС.СсылкаНаПозицию,СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	
	СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗаполнитьЗначения(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета,"Смета");
	
	Если ПромОкр Тогда
		Для каждого СтрокаТаблСЧП Из СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета Цикл
			СтрокаТаблСЧП.СтоимОснЗарплата = Окр(СтрокаТаблСЧП.СтоимОснЗарплата,2);		
			СтрокаТаблСЧП.СтоимЭксплМашин = Окр(СтрокаТаблСЧП.СтоимЭксплМашин,2);		
			СтрокаТаблСЧП.СтоимЗарплМашин = Окр(СтрокаТаблСЧП.СтоимЗарплМашин,2);		
			СтрокаТаблСЧП.СтоимСтоимМатер = Окр(СтрокаТаблСЧП.СтоимСтоимМатер,2);		
			СтрокаТаблСЧП.СтоимОборуд = Окр(СтрокаТаблСЧП.СтоимОборуд,2);		
			СтрокаТаблСЧП.СтоимПрямЗатраты = Окр(СтрокаТаблСЧП.СтоимПрямЗатраты,2);
			СтрокаТаблСЧП.СтоимВозвратМатер = Окр(СтрокаТаблСЧП.СтоимВозвратМатер,2);
			Если ОбрабПогр = Перечисления.СМ_ОбработкаПогрешностиОкругления.ПЗЧерезСумму Тогда
				СтрокаТаблСЧП.СтоимПрямЗатраты = СтрокаТаблСЧП.СтоимОснЗарплата + СтрокаТаблСЧП.СтоимЭксплМашин + СтрокаТаблСЧП.СтоимСтоимМатер;	
			ИначеЕсли ОбрабПогр = Перечисления.СМ_ОбработкаПогрешностиОкругления.РазницуНаНаибольшую Тогда
				
				Разница = СтрокаТаблСЧП.СтоимОснЗарплата + СтрокаТаблСЧП.СтоимЭксплМашин + СтрокаТаблСЧП.СтоимСтоимМатер - СтрокаТаблСЧП.СтоимПрямЗатраты;
				
				Если СтрокаТаблСЧП.СтоимОснЗарплата > СтрокаТаблСЧП.СтоимЭксплМашин И СтрокаТаблСЧП.СтоимОснЗарплата > СтрокаТаблСЧП.СтоимСтоимМатер Тогда
					СтрокаТаблСЧП.СтоимОснЗарплата = СтрокаТаблСЧП.СтоимОснЗарплата - Разница;	
				ИначеЕсли СтрокаТаблСЧП.СтоимЭксплМашин > СтрокаТаблСЧП.СтоимСтоимМатер Тогда
					СтрокаТаблСЧП.СтоимЭксплМашин = СтрокаТаблСЧП.СтоимЭксплМашин - Разница;	
				Иначе
					СтрокаТаблСЧП.СтоимСтоимМатер = СтрокаТаблСЧП.СтоимСтоимМатер - Разница;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ИспользоватьРС Тогда
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета",Отбор,СтруктураДанныхРасчета.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет состава затрат позиции сметы (ОЗ, ЭМ и т.д.).
//
// Параметры:
//     Позиция 			- ДокументОбъект.СМ_ПозицияЛокальнойСметы - объект позиции.
//     ВариантРасчетаЗМ - ПеречислениеСсылка.СМ_ВариантыРасчетаЗМ - вариант расчета составляющей ЗМ.
//     ТаблЕдСтоим 		- ТаблицаЗначений - таблица в которую производится запись результата.
//     ПоБазису 		- Булево - если Истина, то расчитываем по базисным ценам, иначе по текущим.
//
Процедура РасчетЕдиничныхЗначенийСоставляющих(Позиция, ВариантРасчетаЗМ, ТаблЕдСтоим, ПоБазису=Истина) Экспорт
	
	КЧ = Новый КвалификаторыЧисла(20,6);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
		
	РесурсыПозиции = Позиция.РесурсыПозицииЛокальнойСметы.выгрузить();
	РесурсыПозиции.колонки.добавить("СтоимостьБазисная",		ОписаниеТиповЧ);
	РесурсыПозиции.колонки.добавить("СтоимостьБазиснаяЗМ",	ОписаниеТиповЧ);
	РесурсыПозиции.колонки.добавить("ЗатратыТрудаРабочих",	ОписаниеТиповЧ);
	РесурсыПозиции.колонки.добавить("СтоимостьТекущая",		ОписаниеТиповЧ);
	РесурсыПозиции.колонки.добавить("СтоимостьТекущаяЗМ",	ОписаниеТиповЧ);
	
	// Расчет усредненной стоимости зарплаты машинистов. 
	НормаУсредненная = Неопределено;
	ЦенаУсредненная  = 0;
	Для каждого СтрокаПозиции Из Позиция.РесурсыПозицииЛокальнойСметы Цикл
		Если СтрокаПозиции.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
			НормаУсредненная = СтрокаПозиции.НормаРасхода;
			ЦенаУсредненная = СтрокаПозиции.БазиснаяЦена;
			ЦенаУсредненнаяТекущая = СтрокаПозиции.ТекущаяЦена;
			Прервать;
		КонецЕсли;
	КонецЦикла;	

	Для каждого Ресурс Из РесурсыПозиции Цикл
		Если Ресурс.ТипМатериала = Перечисления.СМ_ТипыМатериалов.Учтенный И Не Ресурс.Удален Тогда
			Если Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				Ресурс.ЗатратыТрудаРабочих = Ресурс.НормаРасхода;
			КонецЕсли;
			Ресурс.СтоимостьБазисная	= Ресурс.БазиснаяЦена * Ресурс.НормаРасхода;
			Ресурс.СтоимостьТекущая	= Ресурс.ТекущаяЦена * Ресурс.НормаРасхода;
			Если ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Расчетный  Тогда
				Ресурс.СтоимостьБазиснаяЗМ = Ресурс.БазиснаяЗарплатаМашинистов * Ресурс.НормаРасхода;
				Ресурс.СтоимостьТекущаяЗМ = Ресурс.ТекущаяЗарплатаМашинистов * Ресурс.НормаРасхода;
			КонецЕсли;
			Если Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов И ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Усредненный Тогда
				Ресурс.СтоимостьБазиснаяЗМ = НормаУсредненная * ЦенаУсредненная;
				Ресурс.СтоимостьТекущаяЗМ = НормаУсредненная * ЦенаУсредненнаяТекущая;
			КонецЕсли;
		Иначе
			Ресурс.СтоимостьБазисная	= 0;
		 	Ресурс.СтоимостьБазиснаяЗМ = 0;
			Ресурс.СтоимостьТекущая	= 0;
		 	Ресурс.СтоимостьТекущаяЗМ = 0;
		КонецЕсли;
	КонецЦикла;	
	
	РесурсыПозиции.свернуть("ВидРесурса","СтоимостьБазисная,СтоимостьБазиснаяЗМ,СтоимостьТекущая,СтоимостьТекущаяЗМ,ЗатратыТрудаРабочих");
	
	СтрокаРасчета = ТаблЕдСтоим.Добавить();
	Для каждого Ресурс Из  РесурсыПозиции Цикл
		Если Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
			Если ПоБазису = Истина Тогда
				СтрокаРасчета.ОснЗарплата 			= Ресурс.СтоимостьБазисная;
			Иначе
				СтрокаРасчета.ОснЗарплата 			= Ресурс.СтоимостьТекущая;
			КонецЕсли;
			СтрокаРасчета.ЗатратыТрудаРабочих	= Ресурс.ЗатратыТрудаРабочих;
		ИначеЕсли Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
			Если ПоБазису = Истина Тогда
				СтрокаРасчета.ЭксплМашин 			= Ресурс.СтоимостьБазисная;
			Иначе
				СтрокаРасчета.ЭксплМашин 			= Ресурс.СтоимостьТекущая;
			КонецЕсли;
			Если ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Расчетный Тогда
				Если ПоБазису = Истина Тогда
					СтрокаРасчета.ЗарплМашинистов 		= Ресурс.СтоимостьБазиснаяЗМ;
				Иначе
					СтрокаРасчета.ЗарплМашинистов 		= Ресурс.СтоимостьТекущаяЗМ;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
			Если ПоБазису = Истина Тогда
				СтрокаРасчета.СтоимМатериалов 		= Ресурс.СтоимостьБазисная;
			Иначе
				СтрокаРасчета.СтоимМатериалов 		= Ресурс.СтоимостьТекущая;
			КонецЕсли;
		ИначеЕсли Ресурс.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
			Если ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Усредненный Тогда
				Если ПоБазису = Истина Тогда
					СтрокаРасчета.ЗарплМашинистов 		= Ресурс.СтоимостьБазиснаяЗМ;
				Иначе	
					СтрокаРасчета.ЗарплМашинистов 		= Ресурс.СтоимостьТекущаяЗМ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СтрокаРасчета.ПрямЗатраты 		= СтрокаРасчета.ОснЗарплата + СтрокаРасчета.ЭксплМашин + СтрокаРасчета.СтоимМатериалов;

КонецПроцедуры

#КонецОбласти
